Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Create enum
zh_cn: 创建枚举

source: Create enum constant ''{0}''
zh_cn: 创建枚举常量 ''{0}''

source: Create field ''{0}''
zh_cn: 创建字段 ''{0}''

source: Create field ''{0}'' in ''{1}''
zh_cn: 在 ''{1}'' 中创建字段 ''{0}''

source: Create field for parameter
zh_cn: 创建字段参数

source: Create field for parameter ''{0}''
zh_cn: 创建参数 ''{0}'' 的字段

source: Create field from Usage
zh_cn: 从使用创建字段

source: Create field {0}
zh_cn: 创建字段 {0}

source: Create file
zh_cn: 创建文件

source: Create getter and field for ''{0}''
zh_cn: 为 ''{0}'' 创建 getter 和字段

source: Create getter and setter for ''{0}''
zh_cn: 为 ''{0}'' 创建 getter 和 setter

source: Create getter for ''{0}''
zh_cn: 为 ''{0}'' 创建 getter

source: Create getter, setter and field for ''{0}''
zh_cn: 为 ''{0}'' 创建 getter，setter 和字段

source: Create inner {0} ''{1}''
zh_cn: 创建内部 {0} ''{1}''

source: Create interface
zh_cn: 创建接口

source: Create interface {0}
zh_cn: 创建接口 {0}

source: Create local variable ''{0}''
zh_cn: 创建局部变量 ''{0}''

source: Create macrodef
zh_cn: 创建宏定义

source: Create method ''{0}''
zh_cn: 创建方法 ''{0}''

source: Create method ''{0}'' in ''{1}''
zh_cn: 在 ''{1}'' 中创建方法 ''{0}''

source: Create method from usage
zh_cn: 从使用创建方法

source: Create new Java class
zh_cn: 创建新 Java 类

source: Create new changelist
zh_cn: 创建新的更改列表

source: Create new class, interface, file or directory
zh_cn: 创建新的类, 接口, 文件或目录

source: Create new directory or package
zh_cn: 创建新目录或包

source: Create new element
zh_cn: 创建新元素

source: Create new file
zh_cn: 创建新文件

source: Create new folder
zh_cn: 创建新文件夹

source: Create new module from scratch and add it to the project
zh_cn: 从草稿创建模块并添加新模块到该项目

source: Create new module-info.java
zh_cn: 创建新的 module-info.java

source: Create new package
zh_cn: 创建新包

source: Create new package-info.java
zh_cn: 创建新 package-info.java

source: Create new profile
zh_cn: 创建新的配置文件

source: Create new {0} ''{1}''
zh_cn: 创建新的 {0} ''{1}''

source: Create package
zh_cn: 创建包

source: Create package {0}
zh_cn: 创建包 {0}

source: Create parameter ''{0}''
zh_cn: 创建参数 ''{0}''

source: Create parameter from Usage
zh_cn: 从使用创建参数

source: Create patch from changes and copy it to clipboard
zh_cn: 从更改创建补丁并将其复制到剪贴板

source: Create presetdef
zh_cn: 创建预设定义

source: Create project from Eclipse projects
zh_cn: 从 Eclipse 项目来创建项目

source: Create project structure for directory with existing sources or convert existing project model
zh_cn: 根据现有的源码目录创建项目结构或转换现有的项目模型

source: Create project structure for directory with existing sources or convert existing project model.
zh_cn: 根据现有的源码目录创建项目结构或转换现有的项目模型。

source: Create property
zh_cn: 创建属性

source: Create property ''{0}''
zh_cn: 创建属性 ''{0}''

source: Create property ''{0}'' in file ''{1}''
zh_cn: 创建属性 ''{0}'' 文件 ''{1}''

source: Create property From Usage
zh_cn: 从使用创建属性

source: Create property tag
zh_cn: 创建属性标签

source: Create property {0}
zh_cn: 创建属性 {0}

source: Create run configuration
zh_cn: 创建运行配置

source: Create run configuration from context
zh_cn: 根据当前文本创建运行配置

source: Create setter and field for ''{0}''
zh_cn: 为 ''{0}'' 创建 setter 和字段

source: Create setter for ''{0}''
zh_cn: 为 ''{0}'' 创建 setter

source: Create subclass
zh_cn: 创建子类

source: Create target
zh_cn: 创建目标

source: Create target ''{0}''
zh_cn: 创建目标 ''{0}''

source: Create target tag
zh_cn: 创建目标标签

source: Create {0}
zh_cn: 创建 {0}

source: Create {0} ''{1}''
zh_cn: 创建 {0} ''{1}''

source: Create {0} declaration
zh_cn: 创建 {0} 声明

source: Create {0} from &existing sources
zh_cn: 从现有源创建 {0}(&E)

source: Create {0} from &template
zh_cn: 从模板创建 {0}(&T)

source: Create {0} project structure for directory with existing sources or convert existing project model.
zh_cn: 根据现有的源码目录创建 {0} 项目结构或转换现有的项目模型。

source: Create {0} {1}
zh_cn: 创建 {0} {1}

source: Create {0}:
zh_cn: 创建 {0}:

source: Create?
zh_cn: 创建？

source: Created
zh_cn: 创建的

source: Creates Patch for selected revision(s)
zh_cn: 为所选修订创建补丁

source: Creates new HTML file
zh_cn: 创建新 HTML 文件

source: Creates new or reuses existing scratch buffer
zh_cn: 创建新的或重新使用现有的临时缓冲区

source: Creates new scratch file with chosen language
zh_cn: 创建所选语言的新临时文件

source: Creating Deployment Descriptor
zh_cn: 创建部署描述

source: Creating Patch...
zh_cn: 创建补丁...

source: Creating class {0}
zh_cn: 创建 {0} 类

source: Creating directory {0}{1}{2}
zh_cn: 创建目录 {0}{1}{2}

source: Creating file {0}{1}{2}
zh_cn: 创建文件 {0}{1}{2}

source: Creating interface {0}.{1}
zh_cn: 创建接口 {0}.{1}

source: Creating package {0}.{1}
zh_cn: 创建包 {0}.{1}

source: Creation of "{0}" failed.
zh_cn: 创建 "{0}" 失败。

source: Creation of multi-dimensional arrays not supported
zh_cn: 不支持创建多维数组

source: Cu&stom:
zh_cn: 自定义:(&S)

source: Cu_t
zh_cn: 剪切(_T)

source: Cucumber features can be rather verbose.
zh_cn: Cucumber 功能可能比较冗长。

source: Current
zh_cn: 当前

source: Current &method
zh_cn: 当前方法(&M)

source: Current File
zh_cn: 当前文件

source: Current editor font: {0}, {1}
zh_cn: 当前编辑器字体: {0}, {1}

source: Current value = ''{2}''.
zh_cn: 当前值 =''{2}''.

source: Current version
zh_cn: 当前版本:

source: Current version:
zh_cn: 当前版本:

source: Custom
zh_cn: 自定义

source: Custom Folding...
zh_cn: 自定义折叠...

source: Custom HTML boolean tag attributes:
zh_cn: 自定义 HTML 布尔标签属性:

source: Custom HTML tag attributes:
zh_cn: 自定义 HTML 标签属性:

source: Custom HTML tags:
zh_cn: 自定义 HTML 标签:

source: Custom Html Tag
zh_cn: 自定义 HTML 标签

source: Custom attribute name
zh_cn: 自定义属性名

source: Custom folding navigation is not available until indices are built.
zh_cn: 在建立索引前,自定义折叠导航不可用。

source: Custom folding regions
zh_cn: 自定义折叠区域

source: Custom function name
zh_cn: 自定义函数名

source: Custom location.
zh_cn: 自定义位置。

source: Custom tag name
zh_cn: 自定义标签名

source: Custom...
zh_cn: 自定义...

source: Customize Data Views
zh_cn: 自定义数据视图

source: Customize Data Views...
zh_cn: 自定义数据视图...

source: Customize Highlighting Level
zh_cn: 自定义高亮级别

source: Customize Threads View
zh_cn: 自定义线程视图

source: Customize Threads View...
zh_cn: 自定义线程视图...

source: Customize the Editor from line numbers, caret placement and tabs to source code inspections, setting up templates and file encodings.
zh_cn: 自定义编辑器，从行号，插入符位置以及源码 tab 的检查，设置模板及文件编码。

source: Cut
zh_cn: 剪切

source: Cut Line Backward
zh_cn: 反向剪切行

source: Cut to clipboard
zh_cn: 剪切到剪贴板

source: Cut up to Line End
zh_cn: 剪切到行尾

source: Cut/Copy/Paste Actions
zh_cn: 剪切/复制/粘贴操作

source: Cycle
zh_cn: 循环

source: Cycle {0}
zh_cn: 循环 {0}

source: Cyclic Dependencies of {0}
zh_cn: {0} 的循环依赖

source: Cyclic Dependency Analysis
zh_cn: 分析循环依赖

source: Cyclic Expand word
zh_cn: 循环扩展词

source: Cyclic Expand word (Backward)
zh_cn: 循环扩展词(向后)

source: Cyclic Module Dependencies
zh_cn: 循环模块依赖

source: Cyclic _Expand Word
zh_cn: 循环扩展词(_E)

source: Cyclic _Expand Word (Backward)
zh_cn: 循环扩展词(向后)(_E)

source: Cyclic annotation element type
zh_cn: 循环注解元素类型

source: Cyclic dependence: {0}
zh_cn: 循环依赖：{0}

source: Cyclic inheritance involving ''{0}''
zh_cn: 涉及 ''{0}'' 的循环继承

source: Cyclic scrolling in list
zh_cn: 在列表循环滚动

source: D&ialect:
zh_cn: Dialect：(&I)

source: DDdisable
zh_cn: 禁用拖放

source: D_ebug Log Settings...
zh_cn: 调试日志设置...(_E)

source: Darcula
zh_cn: Darcula 黑色主题

source: Data Views
zh_cn: 数据视图

source: Data error (cyclic redundancy check).
zh_cn: 数据错误 (循环冗余检查)。

source: Data flow
zh_cn: 数据流

source: Data flow issues
zh_cn: 数据流问题

source: Date
zh_cn: 日期

source: De&legate via overloading method
zh_cn: 通过重载方式代表(&L)

source: De&lete
zh_cn: 删除(&L)

source: Deannotate
zh_cn: 取消注解

source: Debug Actions
zh_cn: 调试操作

source: Debug Build Process
zh_cn: 调试构建过程

source: Debug info might be corrupt: {0}
zh_cn: 调试信息可能已损坏：{0}

source: Debug info not available
zh_cn: 调试信息不可用

source: Debug info unavailable
zh_cn: 调试信息不可用

source: Debug information is inconsistent
zh_cn: 调试信息不一致

source: Debug libraries are missig from JDK home.nIn order for debugger to start, the libraries should be installed.nPlease visit http://java.sun.com/products/jpda
zh_cn: JDK 主目录缺少调试库.n 为了启动调试器，应该安装库.n 请访问 http://java.sun.com/products/jpda

source: Debug selected configuration
zh_cn: 调试所选的配置

source: Debug selected configuration(s)
zh_cn: 调试所选配置

source: Debug stopped
zh_cn: 调试停止

source: Debugger
zh_cn: 调试器

source: Debugger Actions
zh_cn: 调试器操作

source: Debugger Settings...
zh_cn: 调试器设置...

source: Debugger is already listening
zh_cn: 调试器已经在监听

source: Debugger is waiting for application to start; debug address: ''{0}''; transport: ''{1}''
zh_cn: 调试器正在等待应用程序启动; 调试地址：''{0}''; 传输：''{1}''

source: Debugger mode:
zh_cn: 调试器模式:

source: Debugger: Java
zh_cn: 调试器: Java

source: Debugging is not supported for JDK {0}
zh_cn: JDK {0} 不支持调试

source: Declaration access can be weaker
zh_cn: 访问声明可以更弱

source: Declaration can have final modifier
zh_cn: 声明可以有 final 修饰符

source: Declaration has Javadoc problems
zh_cn: 声明有 Javadoc 的问题

source: Declaration has problems in Javadoc references
zh_cn: 声明在 Javadoc 引用中有问题

source: Declaration not allowed here
zh_cn: 声明不允许在这里

source: Declaration redundancy
zh_cn: 声明冗余

source: Declaration(s) to be generified {0}
zh_cn: 声明是泛型 {0}

source: Declaration, final or effectively final variable expected
zh_cn: 期望申明, final 或有效的 final

source: Declare &final
zh_cn: 声明 final(&F)

source: Declare &static
zh_cn: 声明静态(&S)

source: Declare &static (pass fields as params)
zh_cn: 声明静态(传递字段作为参数)(&S)

source: Declare Variable As External Data
zh_cn: 将变量声明为外部数据

source: Declare external variable as <jsp:useBean />
zh_cn: 声明外部变量为<jsp:useBean />

source: Declare external variable in comment annotation
zh_cn: 在注释注解中声明外部变量

source: Declare invalid id in comment annotation
zh_cn: 在注释注解中声明无效的 id

source: Declare v&arargs
zh_cn: 声明 varargs(可变参数)(&A)

source: Declared &type
zh_cn: 声明类型(&T)

source: Decode Bytes...
zh_cn: 解码字节...

source: Decompiled .class file
zh_cn: 反编译 .class 文件

source: Decrease Font Size
zh_cn: 减小字体大小

source: Decrement Height
zh_cn: 减少高度

source: Decrement Width
zh_cn: 减少宽度

source: Def_ault Settings...
zh_cn: 默认设置...(_A)

source: Default
zh_cn: 默认

source: Default &View
zh_cn: 默认视图(&V)

source: Default ({0})
zh_cn: 默认({0})

source: Default File Template Usage
zh_cn: 默认文件模板的使用

source: Default File template
zh_cn: 默认文件模板

source: Default IDE profile:
zh_cn: 默认的 IDE 配置文件:

source: Default Options
zh_cn: 默认选项

source: Default Project
zh_cn: 当前项目

source: Default Project Profile
zh_cn: 默认项目配置文件

source: Default Project Structure...
zh_cn: 默认项目结构...

source: Default Settings
zh_cn: 默认设置

source: Default Value:
zh_cn: 默认值:

source: Default Visibility
zh_cn: 默认可见性

source: Default annotation parameter value
zh_cn: 默认注解参数值

source: Default constructor in ''{0}'' is deprecated
zh_cn: ''{0}'' 中的默认构造方法是过时的

source: Default constructor in ''{0}'' is deprecated and marked for removal
zh_cn: ''{0}'' 中的默认构造方法是过时的且标记为移除

source: Default encoding for properties files:
zh_cn: 属性文件的默认编码:

source: Default language
zh_cn: 默认语言

source: Default method ''{0}'' is not overridden.
zh_cn: 默认方法 ''{0}'' 未覆盖。

source: Default project
zh_cn: 默认项目

source: Default value
zh_cn: 默认值

source: Default {0, choice, 0#|1#method is|2# methods are} not overridden.
zh_cn: 默认方法未覆盖。

source: Default: {0}
zh_cn: 默认: {0}

source: Defaults
zh_cn: 默认

source: Defer assignment to ''{0}'' using temp variable
zh_cn: 使用临时变量将赋值延迟到 ''{0}''

source: Defer final assignment with temp
zh_cn: 使用 temp 延迟 final 赋值

source: Defined in:\&nbsp;any dtd
zh_cn: 定义于:\&nbsp;any dtd

source: Defined in:\&nbsp;frameset dtd
zh_cn: 定义于:\&nbsp;frameset dtd

source: Defined in:\&nbsp;loose dtd
zh_cn: 定义于:\&nbsp;loose dtd

source: Definition of {0}
zh_cn: {0} 的定义

source: Delay (ms):
zh_cn: 延迟 (毫秒):

source: Delegate mem&bers
zh_cn: 委托成员(&B)

source: Delete
zh_cn: 删除

source: Delete ''{0}''?
zh_cn: 删除 ''{0}''?

source: Delete Active Changelist
zh_cn: 删除活动变更列表

source: Delete All Already Unshelved
zh_cn: 删除所有已取消的搁置

source: Delete All Favorites List But This
zh_cn: 删除除此之外的所有收藏

source: Delete All User-Defined Lists Except ''{0}''
zh_cn: 删除除 ''{0}'' 外所有用户定义的列表

source: Delete Applied Shelved Changes
zh_cn: 删除已应用的搁置更改

source: Delete Bookmark
zh_cn: 删除书签

source: Delete Catch
zh_cn: 删除 catch

source: Delete Changelist
zh_cn: 删除更改列表

source: Delete Confirmation
zh_cn: 删除确认

source: Delete Existing Project and Import
zh_cn: 删除现有项目和导入

source: Delete Favorites List
zh_cn: 删除收藏夹列表

source: Delete Favorites List ''{0}''
zh_cn: 删除收藏夹列表 ''{0}''

source: Delete Issue Navigation Link
zh_cn: 删除问题导航链接

source: Delete Items from Shelf
zh_cn: 从 Shelf 删除条目

source: Delete Line
zh_cn: 删除行

source: Delete Old Output Directories
zh_cn: 删除旧的输出目录

source: Delete Selection
zh_cn: 删除所选

source: Delete all favorites except these
zh_cn: 删除除了这些以外的所有收藏

source: Delete all favorites the selected node belongs to
zh_cn: 删除选中节点所属的所有收藏夹

source: Delete catch for ''{0}''
zh_cn: 为 ''{0}'' 删除 catch

source: Delete directive
zh_cn: 删除指令

source: Delete directive ''requires {0}''
zh_cn: 删除指令 ''requires {0}''

source: Delete element
zh_cn: 删除元素

source: Delete it anyway?
zh_cn: 仍要删除?

source: Delete method body
zh_cn: 删除方法体

source: Delete redundant 'requires' directive
zh_cn: 删除多余的 'requires' 指令

source: Delete redundant 'requires' statement
zh_cn: 删除冗余 'requires' 语句

source: Delete reference
zh_cn: 删除引用

source: Delete reference to module ''{0}''
zh_cn: 删除对模块 ''{0}'' 的引用

source: Delete selected Ant configuration?
zh_cn: 删除选定的 Ant 配置？

source: Delete selected Ant configurations?
zh_cn: 删除选定的 Ant 配置？

source: Delete selected item
zh_cn: 删除选中项

source: Delete selected navigation link?
zh_cn: 删除选定的导航链接？

source: Delete selection
zh_cn: 删除所选

source: Delete statement
zh_cn: 删除语句

source: Delete statement ''requires {0}''
zh_cn: 删除语句 ''requires {0}''

source: Delete statement extracting side effects
zh_cn: 删除包含副作用的语句

source: Delete the selected class, method or field, checking for usages
zh_cn: 删除选中类、方法或字段，并检查使用

source: Delete to Line End
zh_cn: 删除到行尾

source: Delete to Line Start
zh_cn: 删除到行首

source: Delete to Word End
zh_cn: 删除到词尾

source: Delete to Word End in Different "CamelHumps" Mode
zh_cn: 在驼峰匹配模式中删除到词尾

source: Delete to Word Start
zh_cn: 删除到词首

source: Delete to Word Start in Different "CamelHumps" Mode
zh_cn: 在驼峰匹配模式中删除到词首

source: Delete unnecessary method(s)
zh_cn: 删除不必要的方法

source: Delete unreachable statement
zh_cn: 删除不可达语句

source: Delete unused parameter(s)
zh_cn: 删除未使用的参数

source: Delete {0,choice,0#Changelist|2#Changelists}
zh_cn: 删除更改列表

source: Delete {0}
zh_cn: 删除 {0}

source: Delete {0}?
zh_cn: 删除 {0}?

source: Delete...
zh_cn: 删除...

source: Deleted
zh_cn: 删除的

source: Deleted by {0} {1}: {2}
zh_cn: 由 {0} 删除在 {1}: {2}

source: Deleted from file system
zh_cn: 从文件系统中删除

source: Deleted:
zh_cn: 已删除的:

source: Deleting
zh_cn: 删除中

source: Deleting class {0}
zh_cn: 删除类 {0}

source: Deleting directory {0}...
zh_cn: 删除目录 {0} ...

source: Deleting {0}
zh_cn: 删除中 {0}

source: Deny usages of
zh_cn: 禁止被...使用

source: Deny usages of scope ''{0}'' in scope ''{1}''
zh_cn: 在范围 ''{1}'' 禁用范围 ''{0}'' 的使用

source: Dependencies
zh_cn: 依赖

source: Dependencies in imports were ignored.
zh_cn: 忽略了导入中的依赖项。

source: Dependencies of {0}
zh_cn: {0} 的依赖

source: Dependencies of {0} on {1}
zh_cn: 在 {1} 上 {0} 的依赖

source: Dependencies on automatic modules
zh_cn: 依赖于自动模块

source: Dependencies storage format:
zh_cn: 依赖存储格式：

source: Dependency Analysis
zh_cn: 依赖性分析

source: Dependency UI
zh_cn: 依赖关系 UI

source: Dependency Validation
zh_cn: 依赖验证

source: Dependency issues
zh_cn: 依赖性问题

source: Dependency rule ''{0}.'' is violated
zh_cn: 依赖规则 ''{0}.'' 被违反

source: Depending on the context, you can choose to disable inspection, fix all problems, change inspection profile, etc.
zh_cn: 根据上下文，您可以选择禁用检查，修复所有问题，更改检查配置文件等。

source: Depending on your platform, find the Gem Manager in File | Settings (on Windows and *nix), or RubyMine | Preferences, on the page Ruby SDK and Gems.
zh_cn: 根据您的平台，在 File | Settings (在 Windows 和* nix 上)或 RubyMine | Preferences，位于页面 Ruby SDK and Gems 上。

source: Depends on
zh_cn: 依赖于

source: Depends on:
zh_cn: 依赖于:

source: Deployment descriptor file ''{0}'' does not exist
zh_cn: 部署描述符文件 ''{0}'' 不存在

source: Deprecated
zh_cn: 过时的

source: Deprecated :\&nbsp;{0}
zh_cn: 不推荐 :\&nbsp;{0}

source: Deprecated API usage
zh_cn: 过时的 API 的使用

source: Deprecated HTML tag
zh_cn: 弃用的 HTML 标签

source: Deprecated symbol
zh_cn: 已弃用的符号

source: Dereference of <code>#ref</code> #loc may produce <code>java.lang.NullPointerException</code>
zh_cn: 引用 <code>#ref</code> #loc 可能产生 <code>java.lang.NullPointerException</code>

source: Dereference of <code>#ref</code> #loc will produce <code>java.lang.NullPointerException</code>
zh_cn: 引用 <code>#ref</code> #loc 将产生 <code>java.lang.NullPointerException</code>

source: Derived Classes
zh_cn: 派生类

source: Derived Interfaces
zh_cn: 派生接口

source: Derived methods
zh_cn: 派生方法

source: Description
zh_cn: 描述

source: Description copied from class:
zh_cn: 描述从类复制:

source: Description copied from field:
zh_cn: 描述从字段复制：

source: Description copied from interface:
zh_cn: 描述从接口复制:

source: Description is missing in {0} tag for parameter {1}
zh_cn: 参数 {1} 的描述丢失 {0} 标记

source: Description:
zh_cn: 描述:

source: Description:\&nbsp;{0}
zh_cn: 描述:\&nbsp;{0}

source: Design type:
zh_cn: 设计类型:

source: Designer
zh_cn: 设计器

source: Desktop Directory
zh_cn: 桌面目录

source: Destination &package:
zh_cn: 目标包：(&P)

source: Destination package:
zh_cn: 目标包：

source: Detach
zh_cn: 分离

source: Detach Library
zh_cn: 分离库

source: Detach library
zh_cn: 分离库

source: Detach library ''{0}'' from module ''{1}''?
zh_cn: 从模块 ''{1}'' 中分离库 ''{0}''？

source: Detach module from project
zh_cn: 从项目中分离模块

source: Detach selected views to a separate window
zh_cn: 分离当前视图至一个单独的窗口

source: Detach unused library roots
zh_cn: 分离未使用的库根

source: Detach {0} Views
zh_cn: 分离 {0} 视图

source: Details
zh_cn: 详细信息

source: Detect all externally changed files and reload them from disk
zh_cn: 检测所有外部更改的文件，并从磁盘重新加载

source: Detect and use existing file indents for editing
zh_cn: 检测和使用现有的文件缩进进行编辑

source: Detect enumerations limit:
zh_cn: 检测枚举限制:

source: Detect simple content type:
zh_cn: 检测简单内容类型:

source: Detecting Possible Conflicts...
zh_cn: 检测可能的冲突...

source: Detection enumeration from following count
zh_cn: 从下面总数检测枚举

source: Deuteranopia (green)
zh_cn: 绿色盲(绿)

source: Dialog Project Structure will open to help you build the project structure
zh_cn: 项目结构对话框将打开，以帮助您构建项目结构

source: Diamond operator is not applicable for non-parameterized types
zh_cn: Diamond 操作符不适用于非参数化类型

source: Diamond types
zh_cn: Diamond 类型

source: Did you know ... ?
zh_cn: 你知道吗 ... ?

source: Did you know that &productName; allows using multiselection while searching in a file (&shortcut:Find;)?
zh_cn: 你知道 &productName; 允许在文件中搜索时 (&shortcut:Find;) 使用多重选择？

source: Did you know that Quick Definition View ({0}) works in completion lookups as well?
zh_cn: 你是否知道快速定义视图({0})在补全查找里也可用吗?

source: Did you know that Quick Documentation View ({0}) works in completion lookups as well?
zh_cn: 你是否知道快速文档视图({0})在补全查找里也可用吗?

source: Did you know that it's possible to copy rich text ?
zh_cn: 你知道有可能复制富文本吗？

source: Did you know that you can avoid accidental moving of the tool window buttons or editor tabs?
zh_cn: 您是否知道可以避免意外移动工具窗口按钮或编辑器选项卡吗？

source: Did you know that you can close tabs in the editor and the tool windows of &productName; without actually using the context menu commands?
zh_cn: 你知道吗？你可以关闭&productName;的编辑器中的选项卡和工具窗口，而不使用上下文菜单命令。

source: Did you know that you can edit both opening and closing tags in XML/HTML files ?
zh_cn: 你知道你可以同时编辑 XML / HTML 文件中的打开和关闭标签吗？

source: Did you know that you can remove just those tool window buttons you don't currently need?
zh_cn: 你知道你可以移除你当前不需要的那些工具窗口按钮吗？

source: Diff
zh_cn: 比较

source: Diff Between ''{0}'' and ''{1}''
zh_cn: ''{0}'' 和 ''{1}'' 之间的差异

source: Diff Options
zh_cn: 差异选项

source: Diff Tools
zh_cn: 比较工具

source: Diff \& Merge
zh_cn: 差异 \& 合并

source: Diff for Range
zh_cn: 比较范围

source: Diff manager cannot compare ''{0}'' and ''{1}''
zh_cn: 差异管理器无法比较 ''{0}'' 和 ''{1}''

source: Differences highlighting is off
zh_cn: 差异高亮已关闭

source: Differences ignored
zh_cn: 差异忽略

source: Different number of formal and actual parameters
zh_cn: 不同数量的形参和实参

source: Different return type
zh_cn: 不同的返回类型

source: Different strategies for top level nodes
zh_cn: 顶级节点的不同策略

source: Digit or '}' expected
zh_cn: 期望数字或 '}'

source: Digit, '}' or ',' expected
zh_cn: 期望数字, '}' 或 ','

source: Direct&ory:
zh_cn: 目录:(&O)

source: Directed Orthogonal Layout
zh_cn: 定向正交布局

source: Direction
zh_cn: 方向

source: Direction is determined by initial character(s)
zh_cn: 方向由初始字符决定

source: Directive end expected
zh_cn: 期望 Directive 结束

source: Directories
zh_cn: 目录

source: Directories to be moved to {0}
zh_cn: 要移动到 {0} 的目录

source: Directory
zh_cn: 目录

source: Directory "{0}" is not found
zh_cn: 目录 "{0}" 没有找到

source: Directory "{0}" is read-only
zh_cn: 目录 "{0}" 是只读的

source: Directory ''{0}''
zh_cn: 目录 ''{0}''

source: Directory Diff
zh_cn: 目录比较

source: Directory Does Not Exist
zh_cn: 目录不存在

source: Directory already exists.
zh_cn: 目录已经存在。

source: Directory for Downloaded Libraries
zh_cn: 下载的库的目录

source: Directory is invalid {0}
zh_cn: 目录无效 {0}

source: Directory is not readable {0}
zh_cn: 目录不可读 {0}

source: Directory {0}
zh_cn: 目录 {0}

source: Directory {0} already contains a file named ''{1}''
zh_cn: 目录 {0} 已包含名为 ''{1}'' 的一个文件

source: Directory {0} already contains {1} named ''{2}''
zh_cn: 目录 {0} 已包含名为 ''{2}'' 的 {1}

source: Directory {0} cannot be created.
zh_cn: 目录 {0} 无法创建。

source: Directory {0} cannot be found
zh_cn: 无法找到目录 {0}

source: Directory {0} contains read-only file(s).
zh_cn: 目录 {0} 包含只读文件。

source: Directory/Package
zh_cn: 目录/包

source: Directory: {0}
zh_cn: 目录:{0}

source: Disable
zh_cn: 禁用

source: Disable ''{0}''
zh_cn: 禁用 ''{0}''

source: Disable All and Restart
zh_cn: 禁用全部并重新启动

source: Disable Hints
zh_cn: 禁用提示

source: Disable JIT
zh_cn: 禁用 JIT

source: Disable Plugin
zh_cn: 禁用插件

source: Disable again
zh_cn: 再次禁用

source: Disable and &Restart
zh_cn: 禁用并重启(&R)

source: Disable breakpoint
zh_cn: 禁用断点

source: Disable inspection
zh_cn: 禁用检查

source: Disable mnemonics in &menu
zh_cn: 在菜单中禁用助记符(&M)

source: Disable mnemonics in controls
zh_cn: 禁用控制中的助记符

source: Disable plugin {0}
zh_cn: 禁用插件 {0}

source: Disable until breakpoint is hit:
zh_cn: 禁用，直到断点命中：

source: Disabled
zh_cn: 禁用

source: Disabled until selected breakpoint is hit:
zh_cn: 禁用,直到选定的断点被触发:

source: Disconnect
zh_cn: 断开连接

source: Disconnect (if available)
zh_cn: 断开连接(如果可用)

source: Disconnected
zh_cn: 已断开

source: Disconnected from the target VM, address: ''{0}'', transport: ''{1}''
zh_cn: 与目标虚拟机断开连接，地址：''{0}''，传输：''{1}''

source: Discover
zh_cn: 发现

source: Display
zh_cn: 显示

source: Display icons in menu items
zh_cn: 在菜单项中显示图标

source: Display name:
zh_cn: 显示名称:

source: Display notification on build completion
zh_cn: 在构建完成后显示通知

source: Display options dialog when these commands are invoked
zh_cn: 调用以下命令时显示选项对话框

source: Display settings &before launching
zh_cn: 运行前显示配置(&B)

source: Displays a string input dialog
zh_cn: 显示字符串输入对话框

source: Do &Not Delete
zh_cn: 不删除(&N)

source: Do &not remove
zh_cn: 不要移除(&N)

source: Do &not replace
zh_cn: 不替换(&N)

source: Do Not Execute
zh_cn: 不执行

source: Do Not Mark
zh_cn: 不标记

source: Do not Indent Children Of
zh_cn: 不要缩进...的子元素

source: Do not ask again
zh_cn: 不再询问

source: Do not force
zh_cn: 不强制

source: Do not highlight
zh_cn: 不高亮

source: Do not ignore
zh_cn: 不要忽略

source: Do not import settings
zh_cn: 不导入设置

source: Do not indent children of:
zh_cn: 不缩进子元素:

source: Do not indent top level class members
zh_cn: 不缩进顶级类成员

source: Do not report loops
zh_cn: 不要报告循环

source: Do not show duplicates simpler than
zh_cn: 不显示比...更简单的重复

source: Do not show hints for current method
zh_cn: 不显示当前方法的提示

source: Do not show selected files as unversioned
zh_cn: 不将选中文件显示为未加入版本控制

source: Do not show this dialog in the future
zh_cn: 以后不再显示这个对话框
